{
  "fighter": [
    {
      "level": 1,
      "id": "second-wind",
      "name": "Second Wind",
      "shortDescription": "Regain hit points as a bonus action",
      "description": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level.",
      "actionType": "bonus",
      "category": "defensive",
      "usable": true,
      "damage": {
        "formula": "1d10",
        "type": "healing"
      },
      "uses": {
        "max": 1,
        "per": "short rest"
      }
    },
    {
      "level": 1,
      "id": "fighting-style-dueling",
      "name": "Fighting Style: Dueling",
      "shortDescription": "+2 damage when wielding one weapon",
      "description": "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.",
      "actionType": "passive",
      "category": "combat"
    },
    {
      "level": 2,
      "id": "action-surge",
      "name": "Action Surge",
      "shortDescription": "Take an additional action on your turn",
      "description": "You can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action. Once you use this feature, you must finish a short or long rest before you can use it again.",
      "actionType": "action",
      "category": "combat",
      "usable": true,
      "uses": {
        "max": 1,
        "per": "short rest"
      }
    }
  ],
  "barbarian": [
    {
      "level": 1,
      "id": "rage",
      "name": "Rage",
      "shortDescription": "Enter a battle fury for bonus damage and resistance",
      "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain advantage on Strength checks and saving throws, +2 damage to melee attacks, and resistance to physical damage.",
      "actionType": "bonus",
      "category": "combat",
      "usable": true,
      "uses": {
        "max": 2,
        "per": "long rest"
      },
      "effects": [
        "Advantage on STR checks and saves",
        "+2 melee damage",
        "Resistance to bludgeoning, piercing, slashing"
      ]
    },
    {
      "level": 1,
      "id": "unarmored-defense",
      "name": "Unarmored Defense",
      "shortDescription": "AC = 10 + DEX + CON when not wearing armor",
      "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
      "actionType": "passive",
      "category": "defensive"
    }
  ],
  "rogue": [
    {
      "level": 1,
      "id": "sneak-attack",
      "name": "Sneak Attack",
      "shortDescription": "Deal extra damage when you have advantage",
      "description": "Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.",
      "actionType": "passive",
      "category": "combat",
      "usable": true,
      "damage": {
        "formula": "1d6",
        "type": "weapon"
      }
    },
    {
      "level": 2,
      "id": "cunning-action",
      "name": "Cunning Action",
      "shortDescription": "Dash, Disengage, or Hide as a bonus action",
      "description": "Your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action.",
      "actionType": "bonus",
      "category": "utility",
      "usable": true
    }
  ],
  "wizard": [
    {
      "level": 1,
      "id": "arcane-recovery",
      "name": "Arcane Recovery",
      "shortDescription": "Recover spell slots during short rest",
      "description": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up).",
      "actionType": "action",
      "category": "utility",
      "usable": true,
      "uses": {
        "max": 1,
        "per": "long rest"
      }
    }
  ],
  "cleric": [
    {
      "level": 1,
      "id": "channel-divinity-turn-undead",
      "name": "Channel Divinity: Turn Undead",
      "shortDescription": "Force undead creatures to flee",
      "description": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.",
      "actionType": "action",
      "category": "combat",
      "usable": true,
      "uses": {
        "max": 1,
        "per": "short rest"
      },
      "saveDC": {
        "ability": "wis"
      },
      "range": "30 feet"
    }
  ],
  "paladin": [
    {
      "level": 1,
      "id": "lay-on-hands",
      "name": "Lay on Hands",
      "shortDescription": "Heal yourself or others with divine power",
      "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5.",
      "actionType": "action",
      "category": "defensive",
      "usable": true,
      "uses": {
        "max": 5,
        "per": "long rest"
      }
    },
    {
      "level": 2,
      "id": "divine-smite",
      "name": "Divine Smite",
      "shortDescription": "Expend spell slot to deal extra radiant damage",
      "description": "When you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st.",
      "actionType": "reaction",
      "category": "combat",
      "usable": true,
      "damage": {
        "formula": "2d8",
        "type": "radiant"
      }
    }
  ],
  "ranger": [
    {
      "level": 1,
      "id": "favored-enemy",
      "name": "Favored Enemy",
      "shortDescription": "Advantage on tracking and knowledge of specific creature types",
      "description": "You have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose a type of favored enemy. You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.",
      "actionType": "passive",
      "category": "utility"
    },
    {
      "level": 1,
      "id": "natural-explorer",
      "name": "Natural Explorer",
      "shortDescription": "Ignore difficult terrain, advantage on initiative",
      "description": "You are particularly familiar with one type of natural environment. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled. While traveling for an hour or more in your favored terrain, difficult terrain doesn't slow your group's travel, you can't become lost except by magical means, you remain alert to danger even when engaged in another activity, and you can move stealthily at a normal pace while alone.",
      "actionType": "passive",
      "category": "utility"
    },
    {
      "level": 2,
      "id": "fighting-style-archery",
      "name": "Fighting Style: Archery",
      "shortDescription": "+2 bonus to attack rolls with ranged weapons",
      "description": "You gain a +2 bonus to attack rolls you make with ranged weapons.",
      "actionType": "passive",
      "category": "combat"
    },
    {
      "level": 2,
      "id": "spellcasting",
      "name": "Spellcasting",
      "shortDescription": "Cast ranger spells using Wisdom",
      "description": "You have learned to use the magical essence of nature to cast spells. Wisdom is your spellcasting ability for ranger spells.",
      "actionType": "passive",
      "category": "utility"
    },
    {
      "level": 3,
      "id": "primeval-awareness",
      "name": "Primeval Awareness",
      "shortDescription": "Sense presence of certain creature types",
      "description": "You can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you: aberrations, celestials, dragons, elementals, fey, fiends, and undead.",
      "actionType": "action",
      "category": "utility",
      "usable": true
    },
    {
      "level": 5,
      "id": "extra-attack",
      "name": "Extra Attack",
      "shortDescription": "Attack twice when you take the Attack action",
      "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn.",
      "actionType": "passive",
      "category": "combat"
    },
    {
      "level": 8,
      "id": "lands-stride",
      "name": "Land's Stride",
      "shortDescription": "Move through nonmagical difficult terrain without penalty",
      "description": "Moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.",
      "actionType": "passive",
      "category": "utility"
    },
    {
      "level": 10,
      "id": "hide-in-plain-sight",
      "name": "Hide in Plain Sight",
      "shortDescription": "+10 bonus to Stealth when not moving",
      "description": "You can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage. Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions.",
      "actionType": "action",
      "category": "utility",
      "usable": true,
      "uses": {
        "max": null,
        "per": "unlimited"
      }
    },
    {
      "level": 14,
      "id": "vanish",
      "name": "Vanish",
      "shortDescription": "Can't be tracked except by magical means, Hide as bonus action",
      "description": "You can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail.",
      "actionType": "bonus",
      "category": "utility",
      "usable": true
    },
    {
      "level": 18,
      "id": "feral-senses",
      "name": "Feral Senses",
      "shortDescription": "Detect invisible creatures within 30 feet",
      "description": "You gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't blinded or deafened.",
      "actionType": "passive",
      "category": "combat"
    },
    {
      "level": 20,
      "id": "foe-slayer",
      "name": "Foe Slayer",
      "shortDescription": "Add Wisdom modifier to attack or damage vs favored enemy",
      "description": "You become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied.",
      "actionType": "passive",
      "category": "combat"
    }
  ],
  "monk": [
    {
      "level": 1,
      "id": "martial-arts",
      "name": "Martial Arts",
      "shortDescription": "Use DEX for unarmed strikes, deal 1d4 damage",
      "description": "Your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons. You can use Dexterity instead of Strength for attacks with monk weapons or unarmed strikes. You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon.",
      "actionType": "passive",
      "category": "combat",
      "damage": {
        "formula": "1d4",
        "type": "bludgeoning"
      }
    },
    {
      "level": 2,
      "id": "ki",
      "name": "Ki",
      "shortDescription": "Spend ki points for special abilities",
      "description": "Your training allows you to harness the mystic energy of ki. You have 2 ki points. You can spend these points to fuel various ki features. When you spend a ki point, it is unavailable until you finish a short or long rest.",
      "actionType": "passive",
      "category": "utility"
    },
    {
      "level": 2,
      "id": "flurry-of-blows",
      "name": "Flurry of Blows",
      "shortDescription": "Make two unarmed strikes as bonus action (1 ki)",
      "description": "Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.",
      "actionType": "bonus",
      "category": "combat",
      "usable": true,
      "damage": {
        "formula": "2d4",
        "type": "bludgeoning"
      }
    }
  ],
  "warlock": [
    {
      "level": 1,
      "id": "eldritch-blast",
      "name": "Eldritch Blast",
      "shortDescription": "Fire a beam of crackling energy (cantrip)",
      "description": "A beam of crackling energy streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 force damage.",
      "actionType": "action",
      "category": "spell-like",
      "usable": true,
      "damage": {
        "formula": "1d10",
        "type": "force"
      },
      "range": "120 feet",
      "attack": {
        "bonus": 0
      }
    }
  ]
}
